items = {
    1: [35000, "CatFood", 1],
    2: [99999999, "XP", 1],
    3: [200, "Серебряные билеты", 1],
    4: [100, "Золотые билеты", 1],
    5: [8, "Платиновые билеты", 1],
    6: [200, "Ускорение", 2],
    7: [100, "Treasure Radar", 2],
    8: [200, "Rich Cat", 2],
    9: [100, "Cat CPU", 2],
    10: [200, "Cat Jobs", 2],
    11: [200, "Sniper Cat", 2],
    12: [20, "Фиолетовое семечко", 3],
    13: [20, "Красное семечко", 3],
    14: [20, "Синее семечко", 3],
    15: [20, "Зеленое семечко", 3],
    16: [20, "Желтое семечко", 3],
    17: [20, "Золотой фрукт", 3],
    18: [20, "Красный фрукт", 3],
    19: [20, "Синий фрукт", 3],
    20: [20, "Зеленый фрукт", 3],
    21: [20, "Желтый фрукт", 3],
    22: [20, "Эпический фрукт", 3],
    23: [20, "Elder семечко", 3],
    24: [20, "Elder фрукт", 3],
    25: [20, "Эпическое семечко", 3],
    26: [20, "Фиолетовый фрукт", 3],
    27: ["Нет", "Кот", 6],
    28: [4000, "NP", 6],
    29: [150, "Special Кошачьи Глаза", 5],
    30: [150, "Rare Кошачьи Глаза", 5],
    31: [150, "Super Rare Кошачьи Глаза", 5],
    32: [150, "Uber Rare Кошачьи Глаза", 5],
    33: [70, "Legend Rare Кошачьи Глаза", 5],
    34: [500, "Флажки для перезарядки энергии", 6],
    35: [10, "Помощники Гаматото", 4],
    36: [20, "Aku Семечки", 3],
    37: [20, "Aku Фрукт", 3],
    38: [200, "Кирпичи", 4],
    39: [200, "Перья", 4],
    40: [200, "Уголь", 4],
    41: [200, "Шестеренки", 4],
    42: [200, "Золото", 4],
    43: [200, "Метеорит", 4],
    44: [200, "Кости", 4],
    45: [200, "Аммонит", 4],
    46: [4, "Легендарные билеты", 1],
    50: [20, "Фиолетовые Behemoth Stones", 3],
    51: [20, "Красные Behemoth Stones", 3],
    52: [20, "Синие Behemoth Stones", 3],
    53: [20, "Зеленые Behemoth Stones", 3],
    54: [20, "Радужные Behemoth Stones", 3],
    55: [20, "Фиолетовые Behemoth Crystals", 3],
    56: [20, "Красные Behemoth Crystals", 3],
    57: [20, "Синие Behemoth Crystals", 3],
    58: [20, "Зеленые Behemoth Crystals", 3],
    59: [20, "Желтые Behemoth Crystals", 3],
    60: [70, "Dark Кошачьи Глаза", 5],
    61: [200, "Кирпичи Z", 4],
    62: [200, "Перья Z", 4],
    63: [200, "Уголь Z", 4],
    64: [200, "Шестеренки Z", 4],
    65: [200, "Золото Z", 4],
    66: [200, "Метеорит Z", 4],
    67: [200, "Кости Z", 4],
    68: [200, "Аммонит Z", 4],
    69: [20, "Желтые Behemoth Stones", 3],
    70: [10, "Золотое семечко", 3],
}

categories = {
    1: "Валюты",
    2: "Боевые бонусы",
    3: "Фрукты и Behemoth Stones/Crystals",
    4: "Материалы Отото и помощники Гаматото",
    5: "Кошачьи Глаза",
    6: "Коты, флажки и NP"
}


def categorize_items(items):
    res = {}
    for iid in items:
        cat = items[iid][2]
        if cat not in res:
            res[cat] = {}
        res[cat][iid] = items[iid]

    return res


def get_catalog():
    categorized = categorize_items(items)
    return {"categories": categories, "items": items, "categorized": categorized}
